ssenja/TMM737/BSP/GD32H7xx_HAL/INC/gd32h73x_75x_usart.h
/*!
    \file    gd32h73x_75x_usart.h
    \brief   definitions for the USART

    \version 2026-03-24, V1.6.0, firmware for GD32H73x_75x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32H73X_75X_USART_H
#define GD32H73X_75X_USART_H

#include "gd32h73x_75x.h"

/* USARTx(x=0,1,2,5), UARTx(x=3,4,6,7) definitions */
#define USART0                        (USART_BASE + 0x0000CC00U)            /*!< USART0 base address */
#define USART1                        USART_BASE                            /*!< USART1 base address */
#define USART2                        (USART_BASE + 0x00000400U)            /*!< USART2 base address */
#define UART3                         (USART_BASE + 0x00000800U)            /*!< UART3 base address */
#define UART4                         (USART_BASE + 0x00000C00U)            /*!< UART4 base address */
#define USART5                        (USART_BASE + 0x0000D000U)            /*!< USART5 base address */
#define UART6                         (USART_BASE + 0x00003400U)            /*!< UART6 base address */
#define UART7                         (USART_BASE + 0x00003800U)            /*!< UART7 base address */

/* registers definitions */
#define USART_CTL0(usartx)            REG32((usartx) + 0x00000000U)         /*!< USART control register 0 */
#define USART_CTL1(usartx)            REG32((usartx) + 0x00000004U)         /*!< USART control register 1 */
#define USART_CTL2(usartx)            REG32((usartx) + 0x00000008U)         /*!< USART control register 2 */
#define USART_BAUD(usartx)            REG32((usartx) + 0x0000000CU)         /*!< USART baud rate generator register */
#define USART_GP(usartx)              REG32((usartx) + 0x00000010U)         /*!< USART prescaler and guard time configuration register */
#define USART_RT(usartx)              REG32((usartx) + 0x00000014U)         /*!< USART receiver timeout register */
#define USART_CMD(usartx)             REG32((usartx) + 0x00000018U)         /*!< USART command register */
#define USART_STAT(usartx)            REG32((usartx) + 0x0000001CU)         /*!< USART status register */
#define USART_INTC(usartx)            REG32((usartx) + 0x00000020U)         /*!< USART interrupt status clear register */
#define USART_RDATA(usartx)           REG32((usartx) + 0x00000024U)         /*!< USART receive data register */
#define USART_TDATA(usartx)           REG32((usartx) + 0x00000028U)         /*!< USART transmit data register */
#define USART_CHC(usartx)             REG32((usartx) + 0x000000C0U)         /*!< USART coherence control register */
#define USART_FCS(usartx)             REG32((usartx) + 0x000000D0U)         /*!< USART FIFO control and status register */

/* bits definitions */
/* USARTx_CTL0 */
#define USART_CTL0_UEN                BIT(0)                                /*!< enable USART */
#define USART_CTL0_UESM               BIT(1)                                /*!< enable USART in deep-sleep mode */
#define USART_CTL0_REN                BIT(2)                                /*!< enable receiver */
#define USART_CTL0_TEN                BIT(3)                                /*!< enable transmitter */
#define USART_CTL0_IDLEIE             BIT(4)                                /*!< enable idle line detected interrupt */
#define USART_CTL0_RBNEIE             BIT(5)                                /*!< enable read data buffer not empty interrupt and overrun error interrupt (when FIFO is disabled) */
#define USART_CTL0_RFNEIE             BIT(5)                                /*!< enable receive FIFO not empty interrupt and overrun error interrupt (when FIFO is enabled) */
#define USART_CTL0_TCIE               BIT(6)                                /*!< enable transmission complete interrupt */
#define USART_CTL0_TBEIE              BIT(7)                                /*!< enable transmitter register empty interrupt (when FIFO is disabled) */
#define USART_CTL0_TFNFIE             BIT(7)                                /*!< enable transmit FIFO not full interrupt (when FIFO is enabled) */
#define USART_CTL0_PERRIE             BIT(8)                                /*!< enable parity error interrupt */
#define USART_CTL0_PM                 BIT(9)                                /*!< parity mode */
#define USART_CTL0_PCEN               BIT(10)                               /*!< enable parity control */
#define USART_CTL0_WM                 BIT(11)                               /*!< wakeup method in mute mode */
#define USART_CTL0_WL0                BIT(12)                               /*!< word length 0 */
#define USART_CTL0_MEN                BIT(13)                               /*!< enable mute mode */
#define USART_CTL0_AMIE0              BIT(14)                               /*!< enable address 0 character match interrupt */
#define USART_CTL0_OVSMOD             BIT(15)                               /*!< oversample mode */
#define USART_CTL0_DED                BITS(16,20)                           /*!< enable driver deassertion time */
#define USART_CTL0_DEA                BITS(21,25)                           /*!< enable driver assertion time */
#define USART_CTL0_RTIE               BIT(26)                               /*!< enable receiver timeout interrupt */
#define USART_CTL0_EBIE               BIT(27)                               /*!< enable end of block interrupt */
#define USART_CTL0_WL1                BIT(28)                               /*!< word length 1 */
#define USART_CTL0_AMIE1              BIT(31)                               /*!< enable address 1 character match interrupt */

/* USARTx_CTL1 */
#define USART_CTL1_AMEN0              BIT(0)                                /*!< enable address 0 match mode */
#define USART_CTL1_ADDM0              BIT(4)                                /*!< address 0 detection mode */
#define USART_CTL1_LBLEN              BIT(5)                                /*!< LIN break frame length */
#define USART_CTL1_LBDIE              BIT(6)                                /*!< enable LIN break detection interrupt */
#define USART_CTL1_CLEN               BIT(8)                                /*!< last bit clock pulse */
#define USART_CTL1_CPH                BIT(9)                                /*!< clock phase */
#define USART_CTL1_CPL                BIT(10)                               /*!< clock polarity */
#define USART_CTL1_CKEN               BIT(11)                               /*!< enable ck pin */
#define USART_CTL1_STB                BITS(12,13)                           /*!< stop bits length */
#define USART_CTL1_LMEN               BIT(14)                               /*!< enable LIN mode */
#define USART_CTL1_STRP               BIT(15)                               /*!< swap TX/RX pins */
#define USART_CTL1_RINV               BIT(16)                               /*!< RX pin level inversion */
#define USART_CTL1_TINV               BIT(17)                               /*!< TX pin level inversion */
#define USART_CTL1_DINV               BIT(18)                               /*!< data bit level inversion */
#define USART_CTL1_MSBF               BIT(19)                               /*!< most significant bit first */
#define USART_CTL1_RTEN               BIT(23)                               /*!< enable receiver timeout */
#define USART_CTL1_ADDR0              BITS(24,31)                           /*!< address 0 of the USART terminal */

/* USARTx_CTL2 */
#define USART_CTL2_ERRIE              BIT(0)                                /*!< enable error interrupt in multibuffer communication */
#define USART_CTL2_IREN               BIT(1)                                /*!< enable IrDA mode */
#define USART_CTL2_IRLP               BIT(2)                                /*!< IrDA low-power */
#define USART_CTL2_HDEN               BIT(3)                                /*!< enable half-duplex */
#define USART_CTL2_NKEN               BIT(4)                                /*!< enable NACK in smartcard mode */
#define USART_CTL2_SCEN               BIT(5)                                /*!< enable smartcard mode */
#define USART_CTL2_DENR               BIT(6)                                /*!< enable DMA for reception */
#define USART_CTL2_DENT               BIT(7)                                /*!< enable DMA for transmission */
#define USART_CTL2_RTSEN              BIT(8)                                /*!< enable RTS */
#define USART_CTL2_CTSEN              BIT(9)                                /*!< enable CTS */
#define USART_CTL2_CTSIE              BIT(10)                               /*!< enable CTS interrupt */
#define USART_CTL2_OSB                BIT(11)                               /*!< one sample bit mode */
#define USART_CTL2_OVRD               BIT(12)                               /*!< disable overrun */
#define USART_CTL2_DDRE               BIT(13)                               /*!< disable DMA on reception error */
#define USART_CTL2_DEM                BIT(14)                               /*!< enable driver mode */
#define USART_CTL2_DEP                BIT(15)                               /*!< enable driver polarity mode */
#define USART_CTL2_AMEN1              BIT(16)                               /*!< enable address 1 match mode */
#define USART_CTL2_SCRTNUM            BITS(17,19)                           /*!< smartcard auto-retry number */
#define USART_CTL2_WUM                BITS(20,21)                           /*!< wakeup mode from deep-sleep mode */
#define USART_CTL2_WUIE               BIT(22)                               /*!< enable wakeup from deep-sleep mode interrupt */
#define USART_CTL2_ADDM1              BIT(23)                               /*!< address 1 detection mode */
#define USART_CTL2_ADDR1              BITS(24,31)                           /*!< address 1 of the USART terminal */

